app/controllers/products_controller.rb

INSERT INTO "products" ("category", "created_at", "desc", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["category", "Misc"], ["created_at", "2014-10-20 16:14:10.406479"], ["desc", "Amxed with this "], ["price", 1222], ["title", "Amaze"], ["updated_at", "2014-10-20 16:14:10.406479"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save